lab 수정
